fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбоненскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АбоненскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
	
	Если АбоненскоеОбслуживание Тогда
		
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	АбоненскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
	
	Если АбоненскоеОбслуживание Тогда
		
		Если Элементы.Найти("ВКМ_ДатаНачалаДействия") = Неопределено Тогда
			
			ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
			
		КонецЕсли;
		
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Истина;
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе
		
		Если Элементы.Найти("ВКМ_ДатаНачалаДействия") = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = Ложь;
		Объект.ВКМ_ДатаНачалаДействия = "";
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Ложь;
		Объект.ВКМ_ДатаОкончанияДействия = "";
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Ложь;
		Объект.ВКМ_СуммаАбоненскойПлаты = 0;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		Объект.ВКМ_СтоимостьЧасаРаботы = 0;
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
